DRAMCO/EFM32-RN2483-LoRa-Node/src/main.c
/**************************************************************************//**
 * @file
 * @brief Empty Project
 * @author Energy Micro AS
 * @version 3.20.2
 ******************************************************************************
 * @section License
 * <b>(C) Copyright 2014 Silicon Labs, http://www.silabs.com</b>
 *******************************************************************************
 *
 * This file is licensed under the Silicon Labs Software License Agreement. See 
 * "http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt"  
 * for details. Before using this software for any purpose, you must agree to the 
 * terms of that agreement.
 *
 ******************************************************************************/
#include <stdlib.h>
#include "em_device.h"
#include "em_chip.h"
#include "em_cmu.h"
#include "em_emu.h"
#include "em_gpio.h"
#include "em_i2c.h"
#include "leuart.h"

#include "rtcdriver.h"

#include "i2cspm.h"

#include "bme280.h"
#include "rn2483.h"
#include "delay.h"

#define BUFFERSIZE 50

/** Timer used for bringing the system back to EM0. */


int main(void){

	I2CSPM_Init_TypeDef i2cInit = I2CSPM_INIT_DEFAULT;

	char receiveBuffer[BUFFERSIZE];
	memset(receiveBuffer, '\0', BUFFERSIZE);

	char deviceEUI[] = "00E6457CE8B52C56";
	char applicationEUI[] = "70B3D57ED00096E2";
	char applicationKey[] = "B01931C73C3BEA2CC754343AFF3B1962";

	/*
	char deviceAddress[] = "26011DB5";
	char networkSessionKey[] = "9305CC461CA931F4DA4E16C9339622D0";
	char applicationSessionKey[] = "0A95C8F1FE8BE97ADB71B799B546269A";
	 */

	/* Chip errata */
	CHIP_Init();
	CMU_ClockEnable(cmuClock_GPIO, true);

	InitDelay();
	I2CSPM_Init(&i2cInit);
	Bme280_Init(i2cInit.port);

	GPIO_PinModeSet(gpioPortC, 2, gpioModePushPull, 0);
	/*DelayMs(20);
	GPIO_PinModeSet(gpioPortC, 2, gpioModePushPull, 1);*/

	RN2483_Init(receiveBuffer, BUFFERSIZE);

	//while(1){

		/*sprintf(commandBuffer, "sys get ver\r\n");
		char test[50];
		Leuart_SendCommand(commandBuffer, strlen(commandBuffer), test, 50);*/

		//RN2483_GetHardwareEUI(receiveBuffer, BUFFERSIZE);
		//RN2483_Sleep(1000, receiveBuffer, BUFFERSIZE);


		/*sendLeuartData(commandBuffer, (uint8_t) strlen(commandBuffer));
		DelayMs(70);
		if(Leuart_ResponseAvailable()){
			char test[50];
			Leuart_ReadResponse(test, 50);
			uint8_t d = 4;
		}
		DelayMs(1000);*/
	//}
	//RN2483_Init(receiveBuffer, BUFFERSIZE);

	bool joined = RN2483_SetupOTAA(applicationEUI, applicationKey, deviceEUI, receiveBuffer, BUFFERSIZE);
	//bool joined = RN2483_SetupABP(deviceAddress, applicationSessionKey, networkSessionKey, receiveBuffer, BUFFERSIZE);

	while(1){
		Bme280_TakeForcedMeasurement(i2cInit.port);

		int32_t temperature;
		Bme280_ReadTemperature(i2cInit.port, &temperature);
		int16_t tempLPP = (int16_t) round((float)temperature/10);

		int32_t pressure;
		Bme280_ReadPressure(i2cInit.port, &pressure);
		int16_t pressureLPP = (int16_t) round((float)pressure/10);

		int32_t humidity;
		Bme280_ReadHumidity(i2cInit.port, &humidity);
		uint8_t humidityLPP = (int8_t) humidity*2;

		if(joined){
			char payload[13];

			// Temperature
			payload[0] = 0x01;
			payload[1] = 0x67;
			payload[2] = (uint8_t)((tempLPP & 0x0000FF00)>>8);
			payload[3] = (uint8_t)(tempLPP & 0x000000FF);

			//Humidity
			payload[4] = 0x02;
			payload[5] = 0x68;
			payload[6] = humidityLPP ;

			//Pressure
			payload[7] = 0x03;
			payload[8] = 0x73;
			payload[9] = (uint8_t)((pressureLPP & 0x0000FF00)>>8);
			payload[10] = (uint8_t)(pressureLPP & 0x000000FF);

			payload[11] = '\0';
			RN2483_TransmitUnconfirmed(payload, 22, receiveBuffer, BUFFERSIZE);
		}
		RN2483_Sleep(10000, receiveBuffer, BUFFERSIZE);
		//DelayMs(1000);
	}

}
